{"id":"64780abf55fd2665e1f6adbe","userName":"bqwerr","projects":[{"tags":["Machine Learning Algorithms","Full Stack Web Application","Python","SQLite"],"icon":"./assets/images/project-1.jpg","title":"Image Retrieval System","description":"This project aims to design a facial recognition system for police as a security control feature. The system helps the police to detect events in the video frames to capture criminals/thieves/individuals who already have criminal records maintained in the police databases. This Criminal Record Management System detects criminals using the KNN algorithm-based Machine Learning Model in real-time videos, and images to alert the human supervisor and expedite the search that might otherwise be overlooked or take a long time to detect manually. Additional features of this system include registering complaints, applying for NOCs (No Objection Certificates), and requesting appointments with the higher officials in the police department, where police can view those requests and accelerate the overall procedures.","readme":"https://bqwerr.github.io/Criminal-Record-Management-System","repository":"https://github.com/bqwerr/Criminal-Record-Management-System","duration":"February 2021","items":["Built a content based Image retrieval system for Police to get criminal records of suspects.","Implemented KNN Algorithm to match the suspect image to the actual criminal record over a database","Developed an endpoint to accept image frames and provide inputs to the trained mode","'Deployed the endpoint using Heroku PaaS to interact using HTTP requests."],"demo":""},{"tags":["Machine Learning","Natural Language Processing","Python","SQLite","Django-Rest Framework","ReactJS"],"icon":"./assets/images/project-1.jpg","title":"Crime Awareness ChatBot","description":"This project aims to create a user-friendly chatbot that could be used to create awareness about the crimes in the city, by fetching past statistical data. The chatbot will respond to the citizen queries, recognize the intent of the query using trained data, and get entities. The portal also shows interactive visualizations, heatmaps of frequent crime histories, and past data for different types of crimes. Using the chatbot citizen can raise an SOS request to share the location with nearby police stations. An API endpoint is created to accept queries over the internet so that chat applications like Telegram can easily consume this service to integrate the Chatbot into their platforms.","readme":"https://bqwerr.github.io/Crime-Awareness-Bot","repository":"https://github.com/bqwerr/Crime-Awareness-Bot","duration":"May 2021","items":["Collected & pre-processed crime related data using NLTK for training a Neural Network model.","Applied Intent Classification Algorithm to understand the actual intent of user query.","Integrated the ChatBot on Telegram using provided API’s."],"demo":"http://pure-falls-99447.herokuapp.com/"},{"tags":["Backend","Spring Boot","Java","PostgreSQL"],"icon":"./assets/images/project-1.jpg","title":"Travel Management Service","description":"This project aims to design and develop secure Java API endpoints and consume them at the frontend portal for Travel Management. Backend API endpoints are built using Spring MVC Framework and frontend components are built using React JS Framework. This Travel Management Portal accepts, rejects, and manages the permissions raised by application users. Authentication and Authorization to the endpoints are secured by JSON Web Tokens.","readme":"https://bqwerr.github.io/spring-epass-service","repository":"https://github.com/bqwerr/spring-epass-service","duration":"August 2020","items":["Modified frontend components for Forms and Dashboard using React-Bootstrap.","Developed Java backend API with endpoints for authentication, permissions, users, and admin scenarios.","Enabled JWT token based authentication mechanism to secure access to the endpoints."],"demo":"http://epass-service.herokuapp.com/api/posts/all"},{"tags":["ReactJS","Full Stack Web Application"],"icon":"./assets/images/project-1.jpg","title":"Travel-Permissions Management Portal","description":"The Portal has frontend components built using ReactJS. The main objective of this application is to create a user friendly dashboard for the travel admins, to view the applications raised by the users. This application consumes the backend API Travel Management Service to accept, reject and manage travel permissions.","readme":"https://bqwerr.github.io/react-epass-portal","repository":"https://github.com/bqwerr/react-epass-portal","duration":"August 2020","items":["Modified frontend components for Forms and Dashboard using React-Bootstrap.","Developed Java backend API with endpoints for authentication, permissions, users, and admin scenarios.","Enabled JWT token based authentication mechanism to secure access to the endpoints."],"demo":"http://epass-portal.herokuapp.com/"},{"tags":["Full Stack Web Application","SQLite","Django Web Framework","Python","JavaScript"],"icon":"./assets/images/project-1.jpg","title":"Virtual Police Platform","description":"Web Application for Citizen & Police to manage raised requests in the portal. This application is built using Django Web Application Framework.","readme":"https://bqwerr.github.io/city-desk","repository":"https://github.com/bqwerr/city-desk","duration":"","items":["Citizen can raise Compliants, NOC Requests, Appointment Requests","Police can view latest requests in the dashboard","Custom User model has been implemented for citizen","Decorators are used for role based views","Used django built-in authentication system for login, logout, sign-up and password reset"],"demo":"http://citydesk.herokuapp.com/"}]}