{
  "projects": [
    {
      "icon": "./assets/images/project-1.jpg",
      "title": "Virtual Police Platform",
      "duration": "",
      "tags": ["Full Stack Web Application", "SQLite", "Django Web Framework", "Python"],
      "readme": "https://bqwerr.github.io/city-desk",
      "repository": "https://github.com/bqwerr/city-desk",
      "description": "Web Application for Citizen & Police to manage raised requests in the portal. This application is built using Django Web Application Framework.",
      "items": [
        "Citizen can raise Compliants, NOC Requests, Appointment Requests",
        "Police can view latest requests in the dashboard",
        "Custom User model has been implemented for citizen",
        "Decorators are used for role based views",
        "Used django built-in authentication system for login, logout, sign-up and password reset"
      ],
      "demo": "http://citydesk.herokuapp.com/"
    },
    {
      
      "tags": ["ReactJS", "Full Stack Web Application"],
      "title": "Travel-Permissions Management Portal",
      "icon": "./assets/images/project-1.jpg",
      "description": "The Portal has frontend components built using ReactJS. The main objective of this application is to create a user friendly dashboard for the travel admins, to view the applications raised by the users. This application consumes the backend API Travel Management Service to accept, reject and manage travel permissions.",
      "readme": "https://bqwerr.github.io/react-epass-portal",
      "repository": "https://github.com/bqwerr/react-epass-portal",
      "duration": "August 2020",
      "items": [
        "Modified frontend components for Forms and Dashboard using React-Bootstrap.",
        "Developed Java backend API with endpoints for authentication, permissions, users, and admin scenarios.",
        "Enabled JWT token based authentication mechanism to secure access to the endpoints."
      ],
      "demo": "http://epass-portal.herokuapp.com/"
    },
    {
    
      "tags": ["Backend", "Spring Boot", "Java", "PostgreSQL"],
      "title": "Travel Management Service",
      "icon": "./assets/images/project-1.jpg",
      "description": "This project is a Java backend API built using Spring Boot Framework for the frontend application - Travel Management Portal to accept, reject and manage the travel permissions raised by application users. Authentication and Authorization is secured by Json Web Tokens",
      "readme": "https://bqwerr.github.io/spring-epass-service",
      "repository": "https://github.com/bqwerr/spring-epass-service",
      "duration": "August 2020",
      "items": [
        "Modified frontend components for Forms and Dashboard using React-Bootstrap.",
        "Developed Java backend API with endpoints for authentication, permissions, users, and admin scenarios.",
        "Enabled JWT token based authentication mechanism to secure access to the endpoints."
      ],
      "demo": "http://epass-service.herokuapp.com/api/posts/all"
    },
    
    {
      
      "tags": ["Machine Learning", "Full Stack Web Application", "Python", "SQLite"],
      "icon": "./assets/images/project-1.jpg",
      "title": "Image Retrieval System",
      "description": "The objective of this project is to design a face recognition system for security control. Our system helps the police to detect events that might otherwise be overlooked or take a long time to detect manually.",
      "readme": "https://bqwerr.github.io/Criminal-Record-Management-System",
      "repository": "https://github.com/bqwerr/Criminal-Record-Management-System",
      "duration": "February 2021",
      "items": [
        "Built a content based Image retrieval system for Police to get criminal records of suspects.",
        "Implemented KNN Algorithm to match the suspect image to the actual criminal record over a database",
        "Developed an endpoint to accept image frames and provide inputs to the trained mode",
        "'Deployed the endpoint using Heroku PaaS to interact using HTTP requests."
      ],
      "demo": ""
    },
    {
      
      "tags": ["Machine Learning", "Full Stack Web Application", "Python", "SQLite", "Django-Rest Framework", "ReactJS", "ChatBot"],
      "icon": "./assets/images/project-1.jpg",
      "title": "Crime Awareness ChatBot",
      "description": "The objective of this project is to create a chatbot that can be used to create awareness about the crimes, by fetching statistical data from the dataset. The chatbot will ask query about your problem and fetch the data based on the intents and entities recognized from the trained data. It can also help in registering compliants through chatbot. An interactive Map has been developed in the application to fetch nearby police stations and register an SOS.",
      "readme": "https://bqwerr.github.io/Crime-Awareness-Bot",
      "repository": "https://github.com/bqwerr/Crime-Awareness-Bot",
      "duration": "May 2021",
      "items": [
        "Collected & pre-processed crime related data using NLTK for training a Neural Network model.",
        "Applied Intent Classification Algorithm to understand the actual intent of user query.",
        "Integrated the ChatBot on Telegram using provided API’s."
      ],
      "demo": "http://pure-falls-99447.herokuapp.com/"
    }

  ]
}
